test/goldens/graph-to-dot/graph_test_12.dot
digraph unix {
  graph [ dpi = 72 ]; 
  graph [nodesep = 0.25; ranksep=0.25];
  fontname="Arial"
  node [fontname="Arial"]
  edge [fontname="Arial"]
  subgraph cluster_butterFly_108 {
    label = "butterFly"; // scope
    invisible0 [label = "", shape = point, style=invis]; // butterFly
    subgraph cluster_level3_109 {
      label = "level3"; // scope
      s111_213 [
        label = "s111"; // node
      ];
      c111_227 [
        label = "c111"; // node
      ];
      subgraph cluster_level2_110 {
        label = "level2"; // scope
        s11_214 [
          label = "s11"; // node
        ];
        s10_215 [
          label = "s10"; // node
        ];
        s01_216 [
          label = "s01"; // node
        ];
        s00_217 [
          label = "s00"; // node
        ];
        c00_223 [
          label = "c00"; // node
        ];
        c01_224 [
          label = "c01"; // node
        ];
        c10_225 [
          label = "c10"; // node
        ];
        c11_226 [
          label = "c11"; // node
        ];
        subgraph cluster_level1_111 {
          label = "level1"; // scope
          s1_218 [
            label = "s1"; // node
          ];
          s0_219 [
            label = "s0"; // node
          ];
          c0_221 [
            label = "c0"; // node
          ];
          c1_222 [
            label = "c1"; // node
          ];
          subgraph cluster_level0_112 {
            label = "level0"; // scope
            x_220 [
              label = "x"; // node
            ];
            
          }
          
        }
        
      }
      
    }
    
  }
  "s111_213" -> "s11_214";
  "s11_214" -> "s1_218";
  "s10_215" -> "s1_218";
  "s01_216" -> "s0_219";
  "s00_217" -> "s0_219";
  "c11_226" -> "c111_227";
  "s1_218" -> "x_220";
  "s0_219" -> "x_220";
  "c0_221" -> "c00_223";
  "c0_221" -> "c01_224";
  "c1_222" -> "c10_225";
  "c1_222" -> "c11_226";
  "x_220" -> "c0_221";
  "x_220" -> "c1_222";
}
